Revit 2027 API
TessellatedShapeBuilderResult.AreObjectsAvailable Property
 Shows whether 'issues' still contains the original data or whether these data have already been relinquished by 'getGeometricalObjects'. The former is true, the later is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreObjectsAvailable { get; }
Public ReadOnly Property AreObjectsAvailable As Boolean
	Get
public:
property bool AreObjectsAvailable {
	bool get ();
}
member AreObjectsAvailable : bool with get
Property Value
Boolean
See Also
Reference
TessellatedShapeBuilderResult Class
Autodesk.Revit.DB Namespace